app/views/api/recipes/show.json.jbuilder

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
json.ingredients do
  @recipe.ingredients.each do |ingredient|

SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" = $1  [["recipe_id", 1]]
---
json.steps do
  @recipe.steps.each do |step|