app/controllers/api/recipes_controller.rb

  def show
    @recipe = Recipe.includes(:steps, :ingredients, :comments).find(params[:id])
---
SELECT "ingredients"."id" FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "steps"."id" FROM "steps" WHERE "steps"."recipe_id" = $1  [["recipe_id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]