app/controllers/api/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"